# for project documents, use addtional latex styles used in proposal file
:edit-this:
#+EXPORT_FILE_NAME: dbms-lab1-report
#+PROPERTY: header-args :eval no-export
# don't prompt to evaluate code blocks while exporting
#+OPTIONS: toc:nil ^:{}
# set toc below instead of here
#+LATEX_HEADER: \graphicspath{{/home/sujal/programming/college-files/assets/images/}}

# !!!!!!!!!!!!!          only edit this section       !!!!!!
#+LATEX_HEADER: \def\subjectNum{1}
# 1: DBMS
# 2: NM
# 3: OS
# 4: SCR
# 5: S.Eng

#+LATEX_HEADER: \def\labNum{1}
#+LATEX_HEADER: \def\labTitle{Introduction to SQL}
#+LATEX_HEADER: \def\yearSem{II/IV}
#+LATEX_HEADER: \newif \iftoc
# !!!!!!!!!!!!           set toc here by uncommenting option
# \toctrue    
\tocfalse
:end:

#+INCLUDE: "/home/sujal/programming/college-files/assets/template.org" :lines "26-"
** Display all records.
#+begin_src sql :exports both
  select * from student;
  select * from teacher;
#+end_src

#+RESULTS[6652ac7491eae4a9225ca119c5b362107a39c0f4]:
| sid | name     | rn         | batch   |
|-----+----------+------------+---------|
|   1 | Sujal    | 34         | BCA2077 |
|   2 | Rajan    | 20         | BBA2077 |
|   3 | Adesh    | 14         | BCA2076 |
|   4 | Dipen    | 9          | BHM2078 |
|   5 | Bibek    | 30         | BHM2077 |

| tid | name     | faculty    |
|-----+----------+------------|
|   1 | Rajendra | Law        |
|   2 | Himesh   | Computer   |
|   3 | Rabindra | Science    |
|   4 | Aman     | Computer   |
|   5 | Ganesh   | Humanities |


** Display only ID and Name from student table.
#+begin_src sql :results raw :exports both :cache yes
select sid, name from student
#+end_src

#+RESULTS[f14e3b7d7d9a80de23e49a89ae033aff3e51fc53]:
| sid | name  |
|-----+-------|
|   1 | Sujal |
|   2 | Rajan |
|   3 | Adesh |
|   4 | Dipen |
|   5 | Bibek |

** Display Name and faculty from Teacher table.
#+begin_src sql :results raw :exports both :cache yes
select name, faculty from teacher
#+end_src

#+RESULTS[d2381e23921ce3ec6a44927825ff2b2efc81f991]:
| name     | faculty    |
|----------+------------|
| Rajendra | Law        |
| Himesh   | Computer   |
| Rabindra | Science    |
| Aman     | Computer   |
| Ganesh   | Humanities |

** Copy sid and name attribute to new relation ‘info_student’.

#+begin_src sql :results raw :exports both :cache yes
select sid, name into info_student from student; 
select * from info_student;
#+end_src

#+RESULTS[4ea8d75cbf4e0a7021b9ed9a2da928d655a2557b]:
| sid | name  |
|-----+-------|
|   1 | Sujal |
|   2 | Rajan |
|   3 | Adesh |
|   4 | Dipen |
|   5 | Bibek |

** Delete all contents from info_student relation
#+begin_src sql :results raw :exports both :cache yes
truncate table info_student;
select * from info_student;
#+end_src
#+RESULTS[10f355ec9239600ae9b3b7d146caabb31c290456]:
| sid | name |
|-----+------|

